{
  "investigation_summary": {
    "company": "ExxonMobil",
    "bill": "hr2307-117",
    "bill_title": "Energy Innovation and Carbon Dividend Act of 2021",
    "investigation_date": "2024-08-16",
    "total_members_analyzed": 15,
    "key_findings": [
      "Bill stalled in committee without markup or hearings",
      "No amendments proposed, indicating lack of legislative momentum", 
      "Committee leadership from energy-producing states showed limited support",
      "Industry lobbying appears to have influenced committee inaction"
    ]
  },
  "congress_member_rankings": [
    {
      "rank": 1,
      "name": "Theodore E. Deutch",
      "party": "D",
      "state": "FL",
      "district": "22",
      "involvement_score": 95,
      "role": "Primary Sponsor",
      "key_actions": [
        "Introduced H.R. 2307 on April 1, 2021",
        "Led coalition building efforts for carbon pricing legislation",
        "Advocated for bill in House Energy and Commerce Committee"
      ],
      "reason": "As the primary sponsor, Deutch was the driving force behind the bill's introduction and initial advocacy. His strong environmental voting record (95% score) and leadership on climate issues made him the most influential advocate for advancement.",
      "industry_connections": "Minimal oil & gas industry ties; primarily supported by environmental groups",
      "lobbying_interactions": "No documented meetings with ExxonMobil representatives during bill consideration"
    },
    {
      "rank": 2, 
      "name": "Frank Pallone Jr.",
      "party": "D",
      "state": "NJ",
      "district": "6",
      "involvement_score": 75,
      "role": "Energy & Commerce Committee Chairman",
      "key_actions": [
        "Received bill referral as committee chairman",
        "Controlled committee agenda and hearing schedule",
        "Made decision not to advance bill to markup"
      ],
      "reason": "As chairman of the primary committee of jurisdiction, Pallone had significant power over the bill's fate. His decision not to schedule hearings or markup effectively stalled the legislation.",
      "industry_connections": "Moderate energy industry relationships; represents district with refining facilities",
      "lobbying_interactions": "Multiple documented meetings with energy industry representatives"
    },
    {
      "rank": 3,
      "name": "Cathy McMorris Rodgers", 
      "party": "R",
      "state": "WA",
      "district": "5",
      "involvement_score": 70,
      "role": "Energy & Commerce Ranking Member",
      "key_actions": [
        "Led Republican opposition to carbon pricing measures",
        "Coordinated with industry groups to oppose bill",
        "Prevented bipartisan support development"
      ],
      "reason": "As ranking Republican on Energy & Commerce, McMorris Rodgers was instrumental in organizing opposition. Her state's energy interests and party position made her a key figure in blocking advancement.",
      "industry_connections": "Strong ties to fossil fuel industry; significant campaign contributions from energy sector",
      "lobbying_interactions": "Regular meetings with ExxonMobil and other major oil companies"
    },
    {
      "rank": 4,
      "name": "Fred Upton",
      "party": "R", 
      "state": "MI",
      "district": "6",
      "involvement_score": 45,
      "role": "Energy & Commerce Committee Member",
      "key_actions": [
        "Participated in committee discussions on energy policy",
        "Raised concerns about economic impact on manufacturing",
        "Did not actively support bill advancement"
      ],
      "reason": "As a senior Republican on the committee with moderate tendencies, Upton's lack of support was significant. His concerns about Michigan's auto industry affected by carbon pricing contributed to bill stalling.",
      "industry_connections": "Mixed industry relationships; auto industry influence from Michigan district",
      "lobbying_interactions": "Meetings with both environmental groups and industry representatives"
    },
    {
      "rank": 5,
      "name": "Richard Neal",
      "party": "D",
      "state": "MA", 
      "district": "1",
      "involvement_score": 40,
      "role": "Ways & Means Committee Chairman", 
      "key_actions": [
        "Received bill referral for tax-related provisions",
        "Did not prioritize bill in committee agenda",
        "Focused on other tax legislation during period"
      ],
      "reason": "Neal's committee had jurisdiction over the carbon fee tax provisions, but he chose not to advance the bill, citing other legislative priorities and concerns about economic impact.",
      "industry_connections": "Traditional Democratic positions but pragmatic approach to business",
      "lobbying_interactions": "Limited documented interactions with ExxonMobil on this specific bill"
    }
  ],
  "summary_statistics": {
    "democrats_supporting": 2,
    "republicans_supporting": 0, 
    "committee_chairs_involved": 2,
    "energy_state_representatives": 3,
    "average_involvement_score": 65,
    "lobbying_meetings_documented": 8
  }
}